# pandas
## Learn pandas with 'Avocado' dataset

In [3]:
import pandas as pd

In [2]:
print ('pandas version -> ',pd.__version__)

pandas version ->  0.25.1

##### dataSet_link -> https://www.kaggle.com/neuromusic/avocado-prices

In [18]:
# crating a dataframe from the dataset
df = pd.read_csv('data/avocado.csv')

In [4]:
# print the number row of the dataframe, default value is 5
df.head(2)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

In [5]:
# print out the number of row and columns
df.shape

(18249, 14)

In [33]:
# index datatype and memory info
df.info

<bound method DataFrame.info of        Unnamed: 0       Date  AveragePrice  Total Volume     4046       4225  \
0               0 2015-12-27          1.33      64236.62  1036.74   54454.85
1               1 2015-12-20          1.35      54876.98   674.28   44638.81
2               2 2015-12-13          0.93     118220.22   794.70  109149.67
3               3 2015-12-06          1.08      78992.15  1132.00   71976.41
4               4 2015-11-29          1.28      51039.60   941.48   43838.39
...           ...        ...           ...           ...      ...        ...
18244           7 2018-02-04          1.63      17074.83  2046.96    1529.20
18245           8 2018-01-28          1.71      13888.04  1191.70    3431.50
18246           9 2018-01-21          1.87      13766.76  1191.92    2452.79
18247          10 2018-01-14          1.93      16205.22  1527.63    2981.04
18248          11 2018-01-07          1.62      17489.58  2894.77    2356.13

         4770  Total Bags  Small Bags  Large Bags  XLarge Bags          type  \
0       48.16     8696.87     8603.62       93.25          0.0  conventional
1       58.33     9505.56     9408.07       97.49          0.0  conventional
2      130.50     8145.35     8042.21      103.14          0.0  conventional
3       72.58     5811.16     5677.40      133.76          0.0  conventional
4       75.78     6183.95     5986.26      197.69          0.0  conventional
...       ...         ...         ...         ...          ...           ...
18244    0.00    13498.67    13066.82      431.85          0.0       organic
18245    0.00     9264.84     8940.04      324.80          0.0       organic
18246  727.94     9394.11     9351.80       42.31          0.0       organic
18247  727.01    10969.54    10919.54       50.00          0.0       organic
18248  224.53    12014.15    11988.14       26.01          0.0       organic

       year            region
0      2015            Albany
1      2015            Albany
2      2015            Albany
3      2015            Albany
4      2015            Albany
...     ...               ...
18244  2018  WestTexNewMexico
18245  2018  WestTexNewMexico
18246  2018  WestTexNewMexico
18247  2018  WestTexNewMexico
18248  2018  WestTexNewMexico

[18249 rows x 14 columns]>

In [6]:
#print out the column names
df.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [35]:
# summaru statistics for numerical column
df['Total Volume'].describe

<bound method NDFrame.describe of 0         64236.62
1         54876.98
2        118220.22
3         78992.15
4         51039.60
           ...
18244     17074.83
18245     13888.04
18246     13766.76
18247     16205.22
18248     17489.58
Name: Total Volume, Length: 18249, dtype: float64>

In [7]:
# print the given last line of the dataframe, default value is 5
df.tail(2)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
18247,10,2018-01-14,1.93,16205.22,1527.63,2981.04,727.01,10969.54,10919.54,50.00,0.0,organic,2018,WestTexNewMexico
18248,11,2018-01-07,1.62,17489.58,2894.77,2356.13,224.53,12014.15,11988.14,26.01,0.0,organic,2018,WestTexNewMexico

In [8]:
# to check the specific column
df['AveragePrice'].head()

0    1.33
1    1.35
2    0.93
3    1.08
4    1.28
Name: AveragePrice, dtype: float64

In [9]:
albany_df = df[ df['region'] == 'Albany']
albany_df.head(2)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,2015-12-27,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
1,1,2015-12-20,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany

In [10]:
# covert date to datetime
df['Date'] = pd.to_datetime(df['Date'])

In [11]:
# to list out all the index
albany_df.index

Int64Index([    0,     1,     2,     3,     4,     5,     6,     7,     8,
                9,
            ...
            17603, 17604, 17605, 17606, 17607, 17608, 17609, 17610, 17611,
            17612],
           dtype='int64', length=338)

In [12]:
# change the index
# here we will change the index to date
albany_df = albany_df.set_index('Date')
# insted of reassigning we can use inplace- True
#albany_df.set_index('Date', inplace=True)

In [13]:
 albany_df.head(3)

,Unnamed: 0,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
Date,,,,,,,,,,,,,
2015-12-27,0,1.33,64236.62,1036.74,54454.85,48.16,8696.87,8603.62,93.25,0.0,conventional,2015,Albany
2015-12-20,1,1.35,54876.98,674.28,44638.81,58.33,9505.56,9408.07,97.49,0.0,conventional,2015,Albany
2015-12-13,2,0.93,118220.22,794.70,109149.67,130.50,8145.35,8042.21,103.14,0.0,conventional,2015,Albany

In [14]:
# sorting the index
albany_df.sort_index(inplace=True)

In [5]:
# sort data frame by any column
df.sort_values('Large Bags', ascending=True)

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
12385,36,2016-04-17,1.55,25405.66,97.85,24629.54,0.00,678.27,678.27,0.00,0.00,organic,2016,Chicago
10610,28,2015-06-14,2.00,22931.78,5012.28,14260.60,923.15,2735.75,2735.75,0.00,0.00,organic,2015,NewYork
1762,46,2015-02-08,0.64,1151157.44,881998.68,184023.21,5517.00,79618.55,79618.55,0.00,0.00,conventional,2015,PhoenixTucson
1763,47,2015-02-01,0.56,1544750.92,1194635.06,261342.47,6335.66,82437.73,82437.73,0.00,0.00,conventional,2015,PhoenixTucson
1765,49,2015-01-18,0.67,1088608.66,811662.62,200514.36,5643.07,70788.61,70788.61,0.00,0.00,conventional,2015,PhoenixTucson
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
9091,1,2018-03-18,1.05,41386314.12,13707389.51,11061051.69,645380.85,15972492.07,11712807.19,3988101.74,271583.14,conventional,2018,TotalUS
9096,6,2018-02-11,0.97,43167806.09,15870677.70,11541844.87,652856.58,15102426.94,10844852.22,4023485.04,234089.68,conventional,2018,TotalUS
9094,4,2018-02-25,1.06,40021528.76,13829857.87,10415463.59,724330.16,15051877.14,10666942.78,4081397.72,303536.64,conventional,2018,TotalUS
8353,34,2017-05-07,1.09,47293921.60,17076650.82,13549102.59,863471.88,15804696.31,11228049.63,4324231.19,252415.49,conventional,2017,TotalUS
9097,7,2018-02-04,0.87,62505646.52,21620180.90,20445501.03,1066830.22,19373134.37,13384586.80,5719096.61,269450.96,conventional,2018,TotalUS

In [ ]:
albany_df['AveragePrice'].plot()

In [ ]:
# since the grpagh is very dense, will take moving average
# so the first 25 rows will not be taken into consideration while taking mean, and take rest of the row and plot it
albany_df['AveragePrice'].rolling(25).mean().plot()

In [ ]:
# add a new column to the albany data frame
albany_df['price25ma'] = albany_df['AveragePrice'].rolling(25).mean()

In [ ]:
albany_df.head(3)

In [ ]:
# to drop the row that has 'nan' value
albany_df.dropna().head(3)

In [ ]:
# to find all the unique values in a column
# in this we will find the unique values for 'region'
df['region'].unique()

In [18]:
df['type'].unique()

array(['conventional', 'organic'], dtype=object)

In [51]:
# give you the number of regions
df['region'].count()

18249